{
    "Included irrelevant content to the target gene": "The row in the table is not **directly** related to the gene of interest||Action: Delete the content.",
    "Logical error": "A mutation cannot simultaneously be both gain of function and loss of function||Action: You should remove one of them.",
    "Redundant reference": "Some references are not used.||Action: Delete the references.",
    "Incorrect reference": "The reference provided does not support the claim made in the report||Action: Delete the relevant content and the references, unless you find the correct one that supports the claim.",
    "Indirect safety profile": "Safety profiles mentioned are related to drugs targeting the same pathway but not the gene directly||Action: Clarify the context or provide direct safety data for the gene.",
    "Unconfirmed genetic loci": "The reported genetic loci for a specific amino acid change is incorrect or not verified||Action: Verify and provide the correct genetic loci.",
    "Omission of minor adverse effects": "Minor adverse effects of drugs are not mentioned in the safety profile||Action: Include information about minor adverse effects and potential drug intolerances.",
    "SNP association error": "A single SNP is incorrectly associated with multiple amino acid changes or incorrect traits||Action: Re-verify the SNP association and correct the entries and associated traits if needed.",
    "Incomplete disease association": "Not all conditions associated with the gene mutations are mentioned||Action: Update the report to include all known conditions associated with the gene mutations.",
    "Incorrect gene category": "The gene category provided is incorrect based on the gene’s function||Action: Update the gene category to the correct one.",
    "Gene function misclassification": "The function of a specific variant is incorrectly categorized (e.g., gain of function vs. loss of function)||Action: Correct the gene function classification.",
    "Reference verification required": "References need to be verified for accurate association with the reported traits||Action: Verify and update or replace the references if they do not support the claim.",
    "Inappropriate experimental model": "The experimental model used is not suitable for the type of study conducted||Action: Replace with a more appropriate model or clarify its relevance.",
    "Unsupported experimental outcome": "The experimental outcome reported is not supported by the reference provided||Action: Modify or remove the unsupported statement.",
    "Incorrect association of gain of function": "No specific information was found linking the gene variant to gain of function in the HMGCR gene related to the reported trait||Action: Remove the incorrect gain of function association.",
    "Unclear association with trait": "No specific information was found linking the gene variant to the reported trait||Action: Remove or correct the row with the unclear association.",
    "Unverified reference for association": "The reference does not clearly support the specific association mentioned in the report||Action: Remove or correct the reference and the associated claim.",
    "Unreliable reference": "The reference used is not considered a reliable scientific source||Action: Replace the unreliable reference with a more reliable and specific scientific source.",
    "Clarification needed for tissue distribution": "The primary site for the gene’s activity should be clarified in the context of its physiological role||Action: Clarify the primary site of activity while acknowledging other sites if relevant.",
    "Irrelevant tissue mention": "The function of the gene in certain tissues is not directly relevant to the discussed disease||Action: Remove or clarify the mention of tissues not directly relevant to the disease context.",
    "Incorrect disease association": "The report inaccurately states that there are no direct mutations linked to specific diseases for the gene||Action: Update the report to reflect the accurate disease associations.",
    "Relabeling columns": "Column headers in the table are not properly labeled to reflect the content||Action: Relabel the columns to be more accurate and descriptive.",
    "Specificity of experimental models": "The type of experimental models used is not specific enough||Action: Specify the type of human studies, cell lines, or in vivo models used.",
    "Disease-relevant readouts": "The key results do not specify disease-relevant readouts such as specific biomarkers or endpoints||Action: Rephrase the key results to include disease-relevant readouts.",
    "Incorrect Genetic Loci": "The genetic loci provided is not found in the search results||Action: Remove or correct the genetic loci entry.",
    "Incorrect Amino Acid Change": "The amino acid change provided is not found in the search results||Action: Remove or correct the amino acid change entry.",
    "Incorrect sensitivity to signaling": "Claim that knockout mice are sensitive to a signal they lack||Action: Remove the incorrect sensitivity claim.",
    "Table Format Adjustment": "The current table format does not match the required format||Action: Adjust the table to include columns for \"Cell or animal model used,\" \"Tool compound,\" and \"Disease relevant readout.\"",
    "Column Header Changes": "\"Experimental evidence\" and \"Key results\" are not the correct headers||Action: Replace \"Experimental evidence\" with \"Experimental assay\" and \"Key results\" with \"Disease relevant readout.\"",
    "Specification of Animal Model": "Study 2's cell or animal model is not fully specified||Action: Specify the type of animal used in the \"IL12-dependent in vivo colitis model.\"",
    "Tool Compound Identification": "Tool compounds are not specified for Studies 1 and 4||Action: Identify and specify the tool compounds used in Study 1 and Study 4."
}